# GetExtrusionData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCOpeningData..::..GetExtrusionData Method
IFCOpeningData Class See Also
---
Gets extrusion data.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<IFCExtrusionData> GetExtrusionData()
```

Visual Basic
---
```text
Public Function GetExtrusionData As IList(Of IFCExtrusionData)
```

Visual C++
---
```text
public:
IList<IFCExtrusionData^>^ GetExtrusionData()
```

# ### Return Value
The extrusion data.
# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace